app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hello blog"], ["content", "First my post"], ["user_id", 1], ["created_at", "2015-11-30 22:50:14.384899"], ["updated_at", "2015-11-30 22:50:14.384899"]]
---
  def create
    @post = current_user.posts.new(post_params)

    respond_to do |format|
      if @post.save